# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
import numpy as np
import pandas as pd

### 2. Create a Pandas Series containing the elements of the list below.

In [2]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [5]:
ser1 = pd.Series(lst)
ser1

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [10]:
print(ser1[2])

# or

print(pd.Series(lst)[2])

74.4
74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [11]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [33]:
df = pd.DataFrame(b)
df

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [14]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [35]:
df.columns = colnames # found this command online, "just assign it to the .columns attribute"

print(df)

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [36]:
sub_df = df[['Score_1','Score_3','Score_5']]
sub_df

# sel1 = "Score_1"
# sel2 = ['Score_1','Score_3','Score_5']
# sub_df1 = df1[sel2]
# sub_df1 
# This explains why a subset needs 2 sets of [], because you are making a dataframe of a list, so you input the list in [] into the dataframe in another pair of []

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9
5     49.0      0.1     89.1
6     23.3     95.0     26.9
7     27.6     53.8     68.5
8     96.6     53.4     50.1
9     73.7     43.2     34.7

In [29]:
np.random.random( (10,10) ) # this was another example in class to show why if defining an array you need two sets of ()!!!

# because if you only put one set of (), it is like when you input 2 arguments into a function, whereas when ...
# ... defining an array, you are insering ONE tuple, not two different arguments.

array([[0.42119216, 0.49705641, 0.82959667, 0.92792358, 0.07440615,
        0.01664123, 0.80574296, 0.42798447, 0.68401504, 0.50478755],
       [0.86029984, 0.08782409, 0.83844643, 0.92426658, 0.32364958,
        0.07651143, 0.17473299, 0.56768087, 0.37584447, 0.98164659],
       [0.28092324, 0.47997263, 0.31025017, 0.83891179, 0.80941348,
        0.0510452 , 0.64280337, 0.7595457 , 0.82771457, 0.78586626],
       [0.57080353, 0.61011392, 0.1674335 , 0.15988324, 0.18938066,
        0.11662593, 0.79617593, 0.2101581 , 0.56360634, 0.78014895],
       [0.66284181, 0.62287491, 0.803576  , 0.35692066, 0.51569634,
        0.67126736, 0.56532035, 0.75000389, 0.07935469, 0.94569845],
       [0.31568186, 0.54019377, 0.93062459, 0.58264555, 0.9991357 ,
        0.38458778, 0.0652824 , 0.59640048, 0.02093481, 0.46649793],
       [0.2365275 , 0.45306386, 0.89738894, 0.62212684, 0.09229439,
        0.71452596, 0.39636595, 0.39218218, 0.49704163, 0.77811021],
       [0.23730743, 0.26189831, 0.22133501, 0.84639232, 0.04430204,
        0.84542321, 0.23014957, 0.96594353, 0.34185323, 0.88864283],
       [0.86026848, 0.83138293, 0.17395252, 0.00165411, 0.4006356 ,
        0.49949881, 0.54791812, 0.39964226, 0.65163731, 0.46222308],
       [0.25515197, 0.18931101, 0.60630009, 0.4208546 , 0.89812469,
        0.64696607, 0.32499917, 0.57363727, 0.7305603 , 0.50099771]])

### 7. From the original data frame, calculate the average Score_3 value.

In [37]:
df['Score_3'].mean()

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [38]:
df['Score_4'].max()

88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [39]:
df['Score_2'].median()

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [40]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [43]:
df2 = pd.DataFrame(orders)
df2

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [45]:
print("Total quantity ordered: ")
print(df2["Quantity"].sum())

print("Revenue generated: ")
print(df2["Revenue"].sum())

Total quantity ordered:
2978
Revenue generated:
637.0

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [50]:
max = df2["UnitPrice"].max()
print("Most expensive: ", max)

min = df2["UnitPrice"].min()
print("Least expensive: ", min)

print("Difference of: ", (max - min))

Most expensive:  11.95
Least expensive:  0.18
Difference of:  11.77